# Yuhe Wu
# week13 - 2021/11/18
# Python Pandas DataFrame - Mapping, Applying, and Grouping

In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [2]:
#mapping
df = DataFrame({'city':['Alma','Brian Head','Fox Park','Lake Mary'],
               'altitude':[10355,9800,9062,8966]})
df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [3]:
st_map={'Alma':'Colorado',
        'Brian Head':'Utah',
       'Fox Park':'Wyoming',
        'Lake Mary':'California'}
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [4]:
df['state'] = df['city'].map(st_map)
df

         city  altitude       state
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [5]:
# apply
def meter(x):
    return x / 3.2808

In [6]:

df['altitude'] = df['altitude'].apply(meter)
df

         city     altitude       state
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park  2762.131188     Wyoming
3   Lake Mary  2732.870032  California

In [7]:
df['altitude'] = df['altitude'].apply(lambda x: np.nan if x < 850 else x)

In [8]:
df

         city     altitude       state
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park  2762.131188     Wyoming
3   Lake Mary  2732.870032  California

In [9]:
df = DataFrame(np.random.randn(4,3),columns=list('bde'),
              index=['UT','OH','TX','OR'])
df

           b         d         e
UT  1.576709  0.391408  0.277391
OH -0.358744 -0.641603 -0.431468
TX  0.684384 -0.452425  1.999477
OR -1.148715  2.091480 -0.139713

In [10]:
def dif(x):
    return x.max() - x.min()

In [11]:
df.apply(dif)

b    2.725424
d    2.733083
e    2.430945
dtype: float64

In [12]:
df.apply(dif,axis=1)

UT    1.299318
OH    0.282858
TX    2.451902
OR    3.240195
dtype: float64

In [13]:
df.apply(lambda x: x.max() - x.min())

b    2.725424
d    2.733083
e    2.430945
dtype: float64

In [14]:
df.apply(lambda x: x.max() - x.min(), axis=1)

UT    1.299318
OH    0.282858
TX    2.451902
OR    3.240195
dtype: float64

In [15]:
df

           b         d         e
UT  1.576709  0.391408  0.277391
OH -0.358744 -0.641603 -0.431468
TX  0.684384 -0.452425  1.999477
OR -1.148715  2.091480 -0.139713

In [17]:
df.apply(pd.value_counts)

             b    d    e
-1.148715  1.0  NaN  NaN
-0.641603  NaN  1.0  NaN
-0.452425  NaN  1.0  NaN
-0.431468  NaN  NaN  1.0
-0.358744  1.0  NaN  NaN
-0.139713  NaN  NaN  1.0
 0.277391  NaN  NaN  1.0
 0.391408  NaN  1.0  NaN
 0.684384  1.0  NaN  NaN
 1.576709  1.0  NaN  NaN
 1.999477  NaN  NaN  1.0
 2.091480  NaN  1.0  NaN

In [18]:
df.apply(pd.value_counts).fillna(0)

             b    d    e
-1.148715  1.0  0.0  0.0
-0.641603  0.0  1.0  0.0
-0.452425  0.0  1.0  0.0
-0.431468  0.0  0.0  1.0
-0.358744  1.0  0.0  0.0
-0.139713  0.0  0.0  1.0
 0.277391  0.0  0.0  1.0
 0.391408  0.0  1.0  0.0
 0.684384  1.0  0.0  0.0
 1.576709  1.0  0.0  0.0
 1.999477  0.0  0.0  1.0
 2.091480  0.0  1.0  0.0

In [21]:
#groupby
df = DataFrame({'k1':['a','a','b','b','c'],
                'k2':['one','two','one','two','one'],
                'dataset1':np.random.randn(5),
                'dataset2':np.random.randn(5)})
df

  k1   k2  dataset1  dataset2
0  a  one  0.158624  0.824033
1  a  two -0.106283  0.718651
2  b  one -0.375362  0.610074
3  b  two  0.774586 -0.170630
4  c  one -0.868890  1.563888

In [22]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [23]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a   0.026171  0.771342
b   0.199612  0.219722
c  -0.868890  1.563888

In [24]:
df.groupby('k2').mean()

     dataset1  dataset2
k2
one -0.361876  0.999332
two  0.334152  0.274011

In [25]:
df

  k1   k2  dataset1  dataset2
0  a  one  0.158624  0.824033
1  a  two -0.106283  0.718651
2  b  one -0.375362  0.610074
3  b  two  0.774586 -0.170630
4  c  one -0.868890  1.563888

In [26]:
df.groupby(['k1','k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [27]:
df['dataset1'].groupby(df['k1']).count()

k1
a    2
b    2
c    1
Name: dataset1, dtype: int64

In [28]:
df['dataset1'].groupby(df['k1']).mean()

k1
a    0.026171
b    0.199612
c   -0.868890
Name: dataset1, dtype: float64

In [29]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a   0.026171  0.771342
b   0.199612  0.219722
c  -0.868890  1.563888

In [32]:
group = df.groupby(['k1','k2'])[['dataset2']]
group

In [33]:
group.count()

        dataset2
k1 k2
a  one         1
   two         1
b  one         1
   two         1
c  one         1

In [34]:
group.mean()

        dataset2
k1 k2
a  one  0.824033
   two  0.718651
b  one  0.610074
   two -0.170630
c  one  1.563888

In [35]:
df.groupby(['k1','k2'])[['dataset2']].mean()

        dataset2
k1 k2
a  one  0.824033
   two  0.718651
b  one  0.610074
   two -0.170630
c  one  1.563888